saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/Keil.SAMHA1_DFP.1.1.1.pdsc
   </conditions>
   <components>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.0.0"
                 condition="ATSAMHA1G15A">
         <description>Headers and startup code for Microchip ATSAMHA1G15A</description>
         <files>
            <file condition="C" category="include" name="samha1a/include/"/>   <!-- changed by ARM -->
            <file condition="C" category="header" name="samha1a/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="samha1a/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="samha1a/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="samha1a/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="samha1a/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="samha1a/gcc/system_samha1.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="samha1a/gcc/gcc/startup_samha1.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="samha1a/gcc/gcc/samha1g15a_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="samha1a/gcc/gcc/samha1g15a_sram.ld"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="samha1a/iar/system_samha1.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="samha1a/iar/iar/startup_samha1.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="samha1a/iar/iar/samha1g15a_flash.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="samha1a/iar/iar/samha1g15a_sram.icf"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="samha1a/armcc/system_samha1.c"
                  version="1.0.0"
                  attr="config"/>   <!-- added by ARM -->
            <file condition="ARMCC Exe"
                  category="source"
                  name="samha1a/armcc/arm/startup_samha1.s"
                  version="1.0.0"
                  attr="config"/>   <!-- added by ARM -->
         </files>
      </component>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.0.0"
                 condition="ATSAMHA1G16AB">
         <description>Headers and startup code for Microchip ATSAMHA1G16AB</description>
         <files>
            <file condition="C" category="include" name="samha1ab/include/"/>   <!-- changed by ARM -->
            <file condition="C" category="header" name="samha1ab/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="samha1ab/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="samha1ab/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="samha1ab/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="samha1ab/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="samha1ab/gcc/system_samha1.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="samha1ab/gcc/gcc/startup_samha1.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="samha1ab/gcc/gcc/samha1g16ab_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="samha1ab/gcc/gcc/samha1g16ab_sram.ld"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="samha1ab/iar/system_samha1.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="samha1ab/iar/iar/startup_samha1.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="samha1ab/iar/iar/samha1g16ab_flash.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="samha1ab/iar/iar/samha1g16ab_sram.icf"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="samha1ab/armcc/system_samha1.c"
                  version="1.0.0"
                  attr="config"/>   <!-- added by ARM -->
            <file condition="ARMCC Exe"
                  category="source"
                  name="samha1ab/armcc/arm/startup_samha1.s"
                  version="1.0.0"
                  attr="config"/>   <!-- added by ARM -->
         </files>
      </component>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.0.0"
                 condition="ATSAMHA1E16AB">
         <description>Headers and startup code for Microchip ATSAMHA1E16AB</description>
         <files>
            <file condition="C" category="include" name="samha1b/include/"/>   <!-- changed by ARM -->
            <file condition="C" category="header" name="samha1b/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="samha1b/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="samha1b/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="samha1b/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="samha1b/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="samha1b/gcc/system_samha1.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="samha1b/gcc/gcc/startup_samha1.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="samha1b/gcc/gcc/samha1e16ab_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="samha1b/gcc/gcc/samha1e16ab_sram.ld"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="samha1b/iar/system_samha1.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="samha1b/iar/iar/startup_samha1.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="samha1b/iar/iar/samha1e16ab_flash.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="samha1b/iar/iar/samha1e16ab_sram.icf"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="samha1b/armcc/system_samha1.c"
                  version="1.0.0"
                  attr="config"/>   <!-- added by ARM -->
            <file condition="ARMCC Exe"
                  category="source"
                  name="samha1b/armcc/arm/startup_samha1.s"
                  version="1.0.0"
                  attr="config"/>   <!-- added by ARM -->
         </files>
      </component>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.0.0"
                 condition="ATSAMHA1G14A">
         <description>Headers and startup code for Microchip ATSAMHA1G14A</description>
         <files>
            <file condition="C" category="include" name="samha1a/include/"/>   <!-- changed by ARM -->
            <file condition="C" category="header" name="samha1a/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="samha1a/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="samha1a/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="samha1a/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="samha1a/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="samha1a/gcc/system_samha1.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="samha1a/gcc/gcc/startup_samha1.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="samha1a/gcc/gcc/samha1g14a_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="samha1a/gcc/gcc/samha1g14a_sram.ld"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="samha1a/iar/system_samha1.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="samha1a/iar/iar/startup_samha1.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="samha1a/iar/iar/samha1g14a_flash.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="samha1a/iar/iar/samha1g14a_sram.icf"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="samha1a/armcc/system_samha1.c"
                  version="1.0.0"
                  attr="config"/>   <!-- added by ARM -->
            <file condition="ARMCC Exe"
                  category="source"
                  name="samha1a/armcc/arm/startup_samha1.s"
                  version="1.0.0"
                  attr="config"/>   <!-- added by ARM -->
         </files>
      </component>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.0.0"
                 condition="ATSAMHA1G16A">
         <description>Headers and startup code for Microchip ATSAMHA1G16A</description>
         <files>
            <file condition="C" category="include" name="samha1a/include/"/>   <!-- changed by ARM -->
            <file condition="C" category="header" name="samha1a/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="samha1a/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="samha1a/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="samha1a/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="samha1a/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="samha1a/gcc/system_samha1.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="samha1a/gcc/gcc/startup_samha1.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="samha1a/gcc/gcc/samha1g16a_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="samha1a/gcc/gcc/samha1g16a_sram.ld"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="samha1a/iar/system_samha1.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="samha1a/iar/iar/startup_samha1.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="samha1a/iar/iar/samha1g16a_flash.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="samha1a/iar/iar/samha1g16a_sram.icf"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="samha1a/armcc/system_samha1.c"
                  version="1.0.0"
                  attr="config"/>   <!-- added by ARM -->
            <file condition="ARMCC Exe"
                  category="source"
                  name="samha1a/armcc/arm/startup_samha1.s"
                  version="1.0.0"
                  attr="config"/>   <!-- added by ARM -->
         </files>
      </component>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.0.0"
                 condition="ATSAMHA1G15AB">
         <description>Headers and startup code for Microchip ATSAMHA1G15AB</description>
         <files>
            <file condition="C" category="include" name="samha1ab/include/"/>   <!-- changed by ARM -->
            <file condition="C" category="header" name="samha1ab/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="samha1ab/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="samha1ab/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="samha1ab/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="samha1ab/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="samha1ab/gcc/system_samha1.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="samha1ab/gcc/gcc/startup_samha1.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="samha1ab/gcc/gcc/samha1g15ab_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="samha1ab/gcc/gcc/samha1g15ab_sram.ld"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="samha1ab/iar/system_samha1.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="samha1ab/iar/iar/startup_samha1.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="samha1ab/iar/iar/samha1g15ab_flash.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="samha1ab/iar/iar/samha1g15ab_sram.icf"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="samha1ab/armcc/system_samha1.c"
                  version="1.0.0"
                  attr="config"/>   <!-- added by ARM -->
            <file condition="ARMCC Exe"
                  category="source"
                  name="samha1ab/armcc/arm/startup_samha1.s"
                  version="1.0.0"
                  attr="config"/>   <!-- added by ARM -->
         </files>
      </component>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.0.0"
                 condition="ATSAMHA1G14AB">
         <description>Headers and startup code for Microchip ATSAMHA1G14AB</description>
         <files>
            <file condition="C" category="include" name="samha1ab/include/"/>   <!-- changed by ARM -->
            <file condition="C" category="header" name="samha1ab/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="samha1ab/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="samha1ab/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="samha1ab/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="samha1ab/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="samha1ab/gcc/system_samha1.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="samha1ab/gcc/gcc/startup_samha1.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="samha1ab/gcc/gcc/samha1g14ab_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="samha1ab/gcc/gcc/samha1g14ab_sram.ld"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="samha1ab/iar/system_samha1.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="samha1ab/iar/iar/startup_samha1.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="samha1ab/iar/iar/samha1g14ab_flash.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="samha1ab/iar/iar/samha1g14ab_sram.icf"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="samha1ab/armcc/system_samha1.c"
                  version="1.0.0"
                  attr="config"/>   <!-- added by ARM -->
            <file condition="ARMCC Exe"
                  category="source"
                  name="samha1ab/armcc/arm/startup_samha1.s"
                  version="1.0.0"
                  attr="config"/>   <!-- added by ARM -->
         </files>
      </component>
