saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/Keil.SAMHA1_DFP.1.1.1.pdsc
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.0.0"
                 condition="ATSAMHA1E15AB">
         <description>Headers and startup code for Microchip ATSAMHA1E15AB</description>
         <files>
            <file condition="C" category="include" name="samha1b/include/"/>   <!-- changed by ARM -->
            <file condition="C" category="header" name="samha1b/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="samha1b/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="samha1b/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="samha1b/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="samha1b/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="samha1b/gcc/system_samha1.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="samha1b/gcc/gcc/startup_samha1.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="samha1b/gcc/gcc/samha1e15ab_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="samha1b/gcc/gcc/samha1e15ab_sram.ld"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="samha1b/iar/system_samha1.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="samha1b/iar/iar/startup_samha1.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="samha1b/iar/iar/samha1e15ab_flash.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="samha1b/iar/iar/samha1e15ab_sram.icf"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="samha1b/armcc/system_samha1.c"
                  version="1.0.0"
                  attr="config"/>   <!-- added by ARM -->
            <file condition="ARMCC Exe"
                  category="source"
                  name="samha1b/armcc/arm/startup_samha1.s"
                  version="1.0.0"
                  attr="config"/>   <!-- added by ARM -->
         </files>
      </component>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.0.0"
                 condition="ATSAMHA1E14AB">
         <description>Headers and startup code for Microchip ATSAMHA1E14AB</description>
         <files>
            <file condition="C" category="include" name="samha1b/include/"/>   <!-- changed by ARM -->
            <file condition="C" category="header" name="samha1b/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="samha1b/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="samha1b/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="samha1b/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="samha1b/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="samha1b/gcc/system_samha1.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="samha1b/gcc/gcc/startup_samha1.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="samha1b/gcc/gcc/samha1e14ab_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="samha1b/gcc/gcc/samha1e14ab_sram.ld"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="samha1b/iar/system_samha1.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="samha1b/iar/iar/startup_samha1.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="samha1b/iar/iar/samha1e14ab_flash.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="samha1b/iar/iar/samha1e14ab_sram.icf"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="samha1b/armcc/system_samha1.c"
                  version="1.0.0"
                  attr="config"/>   <!-- added by ARM -->
            <file condition="ARMCC Exe"
                  category="source"
                  name="samha1b/armcc/arm/startup_samha1.s"
                  version="1.0.0"
                  attr="config"/>   <!-- added by ARM -->
         </files>
      </component>
   </components>
</package>
